---
kind: type
id: T:Autodesk.Revit.UI.ComboBoxMemberData
source: html/aba69b9c-dae6-c872-8dea-91ef7fda5e81.htm
---
# Autodesk.Revit.UI.ComboBoxMemberData

This class contains information necessary to construct a ComboBoxMember.

## Syntax (C#)
```csharp
public class ComboBoxMemberData : RibbonItemData
```